Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/library.tmx
Source language: en
Languages: pl

source: Note that :class:`ArgumentParser` objects only remove an action if all of its option strings are overridden. So, in the example above, the old ``-f/--foo`` action is retained as the ``-f`` action, because only the ``--foo`` option string was overridden.
pl: Zauważ, że przedmioty :class:`ArgumentParser` usuwają działanie tylko jeśli wszystkie z ich ciągów znaków opcji zostaną przesłonięte. Więc w przykładzie powyższym, stare działanie ``-f/--foo`` jest zachowane jako działanie ``-f``, gdyż tylko ciąg znaków ``--foo`` został przesłonięty.

source: By default, :class:`ArgumentParser` objects uses ``sys.argv[0]`` to determine how to display the name of the program in help messages. This default is almost always desirable because it will make the help messages match how the program was invoked on the command line. For example, consider a file named ``myprogram.py`` with the following code::
pl: Domyślnie, przedmioty :class:`ArgumentParser` używają ``sys.argv[0]`` aby określić jak wyświetlić nazwę programu w wiadomościach pomocy. Ta domyślna wartość jest prawie zawsze oczekiwana ponieważ spowoduje że wiadomości pomocy będą odpowiadały temu jak program został wywołany w wierszu poleceń. Na przykład, rozważ plik nazwany ``myprogram.py`` z następującym kodem::

source: The help for this program will display ``myprogram.py`` as the program name (regardless of where the program was invoked from)::
pl: Pomoc dla tego programu będzie wyświetlała ``myprogram.py`` jako nazwę programu (niezależnie od tego skąd program został wywołany)::

source: $ python myprogram.py --help usage: myprogram.py [-h] [--foo FOO] optional arguments: -h, --help show this help message and exit --foo FOO foo help $ cd .. $ python subdir\myprogram.py --help usage: myprogram.py [-h] [--foo FOO] optional arguments: -h, --help show this help message and exit --foo FOO foo help
pl: $python myprogram.py --help użycie: myprogram.py [-h] [--foo FOO] opcjonalne parametry: -h, --help pokaż ten komunikat pomocy i wyjdź -- foo FOO foo help $ cd .. $ python subdir\myprogram.py --help użycie: myprogram.py [-h] [--foo FOO] opcjonalne parametry: -h --help pokaż ten komunikat pomocy i wyjdź --foo FOO foo help

source: To change this default behavior, another value can be supplied using the ``prog=`` argument to :class:`ArgumentParser`::
pl: Aby zmienić to domyślne zachowanie, inne wartość może być dostarczona używając parametru ``prog=`` dla uogólnienia :class:`ArgumentParser`::

source: >>> parser = argparse.ArgumentParser(prog='myprogram') >>> parser.print_help() usage: myprogram [-h] optional arguments: -h, --help show this help message and exit
pl: >>> parser = argparse.ArgumentParser(prog='myprogram') >>> parser.print_help() użycie: myprogram [-h] opcjonalne parametry: -h, --help pokaż tą wiadomość pomocy i wyjdź

source: Note that the program name, whether determined from ``sys.argv[0]`` or from the ``prog=`` argument, is available to help messages using the ``%(prog)s`` format specifier.
pl: Zauważ, że nazwa programu, określona przez ``sys.argv[0]`` lub przez argument ``prog=`` jest dostępna dla wiadomości pomocy używając ``%(prog)s`` określnika formatującego.

source: >>> parser = argparse.ArgumentParser(prog='myprogram') >>> parser.add_argument('--foo', help='foo of the %(prog)s program') >>> parser.print_help() usage: myprogram [-h] [--foo FOO] optional arguments: -h, --help show this help message and exit --foo FOO foo of the myprogram program
pl: >>> parser = argparse.ArgumentParser(prog='myprogram') >>> parser.add_argument('--foo', help='foo należący do programu %(prog)s') >>> parser.print_help() użycie: myprogram [-h] [--foo FOO] opcjonalne parametry: -h, --help pokaż tą wiadomość pomocy i wyjdź --foo FOO foo należący do programu myprogram

source: usage
pl: użycie

source: By default, :class:`ArgumentParser` calculates the usage message from the arguments it contains::
pl: Domyślnie uogólnienie :class:`ArgumentParser` oblicza wiadomość użycia z parametrów które zawiera::

source: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('--foo', nargs='?', help='foo help') >>> parser.add_argument('bar', nargs='+', help='bar help') >>> parser.print_help() usage: PROG [-h] [--foo [FOO]] bar [bar ...] positional arguments: bar bar help optional arguments: -h, --help show this help message and exit --foo [FOO] foo help
pl: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('--foo', nargs='?', help='foo help') >>> parser.add_argument('bar', nargs='+', help='bar help') >>> parser.print_help() użycie: PROG [-h] [--foo [FOO]] bar [bar ...] pozycyjne parametry: bar bar help opcjonalne parametry: -h, --help pokaż tą wiadomość pomocy i wyjdź --foo [FOO] foo help

source: The default message can be overridden with the ``usage=`` keyword argument::
pl: Domyślna wiadomość może być przesłonięta za pomocą parametru słowa kluczowego ``usage=``::

source: >>> parser = argparse.ArgumentParser(prog='PROG', usage='%(prog)s [options]') >>> parser.add_argument('--foo', nargs='?', help='foo help') >>> parser.add_argument('bar', nargs='+', help='bar help') >>> parser.print_help() usage: PROG [options] positional arguments: bar bar help optional arguments: -h, --help show this help message and exit --foo [FOO] foo help
pl: >>> parser = argparse.ArgumentParser(prog='PROG', usage='%(prog)s [opcje]') >>> parser.add_argument('--foo', nargs='?', help='foo help') >>> parser.add_argument('bar', nargs='+', help='bar help') >>> parser.print_help() użycie: PROG [opcje] pozycyjne parametry: bar bar help opcjonalne parametry: -h, --help pokaż tą wiadomość pomocy i wyjdź --foo [FOO] foo help

source: The ``%(prog)s`` format specifier is available to fill in the program name in your usage messages.
pl: Określenie formatu ``%(prog)s`` jest dostępne do wpisania nazwy programu w twojej wiadomości o użyciu.

source: The add_argument() method
pl: Sposób postępowania add_argument()

source: Define how a single command line argument should be parsed. Each parameter has its own more detailed description below, but in short they are:
pl: Zdefiniuj jak pojedynczy parametr linii poleceń będzie wczytywany. Każdy parametr ma swój własny bardziej szczegółowy opis poniżej, ale w skrócie są to:

source: `name or flags`_ - Either a name or a list of option strings, e.g. ``foo`` or ``-f, --foo``
pl: `name or flags`_ - nazwa lub flagi - Albo nazwa albo lista ciągów znaków opcji, np. ``foo`` lub ``-f, --foo``

source: action_ - The basic type of action to be taken when this argument is encountered at the command-line.
pl: action_ - Podstawowy typ działania podejmowanego gdy ten parametr jest napotykany w wierszu-polecenia.

source: nargs_ - The number of command-line arguments that should be consumed.
pl: nargs_ - liczba parametrów wiersza-polecenia które powinny być skonsumowane.

source: const_ - A constant value required by some action_ and nargs_ selections.
pl: const_ - stała wartość wymagana przez pewne działanie - action_ i nargs_ wyborów.

source: default_ - The value produced if the argument is absent from the command-line.
pl: default_ - wartość tworzona jeśli parametr jest nieobecny w wierszu-polecenia.

source: type_ - The type to which the command-line arg should be converted.
pl: type_ - typ do którego wiersz-poleceń powinien zostać zamieniony.

source: choices_ - A container of the allowable values for the argument.
pl: choices_ - pojemnik dozwolonych wartości parametru.

source: required_ - Whether or not the command-line option may be omitted (optionals only).
pl: required_ - Czy opcja wiersza-polecenia może zostać pominięta (tylko dla opcjonalnych).

source: help_ - A brief description of what the argument does.
pl: help_ - krótki opis co parametr robi.

source: metavar_ - A name for the argument in usage messages.
pl: metavar_ - Nazwa parametru w wiadomościach o użyciu.

source: dest_ - The name of the attribute to be added to the object returned by :meth:`parse_args`.
pl: dest_ - nazwa właściwości do dodania do przedmiotu zwróconego przez :meth:`parse_args`.

source: name or flags
pl: nazwa lub flagi

source: The :meth:`add_argument` method must know whether an optional argument, like ``-f`` or ``--foo``, or a positional argument, like a list of filenames, is expected. The first arguments passed to :meth:`add_argument` must therefore be either a series of flags, or a simple argument name. For example, an optional argument could be created like::
pl: Sposób postępowania :meth:`add_argument` musi wiedzieć czy opcjonalny parametr, taki jak ``-f`` lub ``--foo``, lub pozycyjny parametr, jak lista nazw plików, jest oczekiwana. Pierwszy parametr przekazany do :meth:`add_argument` musi zatem być albo szeregiem flag, albo prostą nazwą parametru. Na przykład, opcjonalny parametr może być tworzony jak w::

source: while a positional argument could be created like::
pl: podczas gdy pozycyjny parametr mógłby być utworzony, jak w::

source: When :meth:`parse_args` is called, optional arguments will be identified by the ``-`` prefix, and the remaining arguments will be assumed to be positional::
pl: Gdy :meth:`parse_args` jest wzywane, opcjonalne parametry będą identyfikowane przez przedrostek ``-``, i pozostałe parametry będą uznawane za pozycyjne::

source: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('-f', '--foo') >>> parser.add_argument('bar') >>> parser.parse_args(['BAR']) Namespace(bar='BAR', foo=None) >>> parser.parse_args(['BAR', '--foo', 'FOO']) Namespace(bar='BAR', foo='FOO') >>> parser.parse_args(['--foo', 'FOO']) usage: PROG [-h] [-f FOO] bar PROG: error: too few arguments
pl: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('-f', '--foo') >>> parser.add_argument('bar') >>> parser.parse_args(['BAR']) Namespace(bar='BAR', foo=None) >>> parser.parse_args(['BAR', '--foo', 'FOO']) Namespace(bar='BAR', foo='FOO') >>> parser.parse_args(['--foo', 'FOO']) użycie: PROG [-h] [-f FOO] bar PROG: error: za mało parametrów

source: action
pl: akcja

source: :class:`ArgumentParser` objects associate command-line args with actions. These actions can do just about anything with the command-line args associated with them, though most actions simply add an attribute to the object returned by :meth:`parse_args`. The ``action`` keyword argument specifies how the command-line args should be handled. The supported actions are:
pl: przedmioty :class:`ArgumentParser` kojarzą parametry wiersza poleceń z działaniami. Te działania mogą robić dowolne rzeczy z parametrami wiersza-poleceń skojarzonymi z nimi, chociaż większość działań po prostu dodaje właściwość do przedmiotu zwracanego przez :meth:`parse_args`. Parametr słowa kluczowego ``akcji`` określa jak parametry wiersza poleceń powinny być obsługiwane. Dostępne działania to:

source: action. For example::
pl: akcja. Dla przykładu::

source: argument. (Note that the const_ keyword argument defaults to the rather unhelpful ``None``.) The ``'store_const'`` action is most commonly used with optional arguments that specify some sort of flag. For example::
pl: parametr. (Zauważ, że parametr słowa kluczowego const_ domyślnie jest równy raczej mało użytecznemu ``None``.) Działanie ``'store_const'`` jest najczęściej używane z opcjonalnymi parametrami, które określają pewnego rodzaju flagę. Na przykład::

source: ``'store_true'`` and ``'store_false'`` - These store the values ``True`` and ``False`` respectively. These are special cases of ``'store_const'``. For example::
pl: ``'store_true'`` i ``'store_false'`` - Te zachowują wartości ``True`` i ``False`` odpowiednio. To są szczególne przypadki ``'store_const'``. Dla przykładu::

source: ``'append'`` - This stores a list, and appends each argument value to the list. This is useful to allow an option to be specified multiple times. Example usage::
pl: ``'append'`` - To zachowuje listę, i dopisuje każdą wartość parametru do listy. To jest użyteczne aby pozwolić aby opcja była określona kilkukrotnie. Przykładowe użycie::

source: ``'append_const'`` - This stores a list, and appends the value specified by the const_ keyword argument to the list. (Note that the const_ keyword argument defaults to ``None``.) The ``'append_const'`` action is typically useful when multiple arguments need to store constants to the same list. For example::
pl: ``'append_const'`` - To zachowuje listę, i dopisuje wartość określoną przez parametr słowa kluczowego const_ do listy. (Zauważ, że parametr słowa kluczowego const_ domyślnie równy jest ``None``.) Akcja ``'append_const'`` jest typowo użyteczna gdy wielokrotne parametry potrzebują dodać stałe wartości do tej samej listy. Dla przykładu::

source: ``'version'`` - This expects a ``version=`` keyword argument in the :meth:`add_argument` call, and prints version information and exits when invoked.
pl: ``'version'`` - To oczekuje słowa kluczowego ``version=`` w wywołaniu :meth:`add_argument`, i wypisuje informacje o wersji i wychodzi gdy wywołane.

source: You can also specify an arbitrary action by passing an object that implements the Action API. The easiest way to do this is to extend :class:`argparse.Action`, supplying an appropriate ``__call__`` method. The ``__call__`` method should accept four parameters:
pl: Możesz także określić dowolne działanie przez przekazanie przedmiotu który wypełnia sprzęg programowania Akcji. Najłatwiejszym sposobem aby to osiągnąć jest rozszerzenie uogólnienia :class:`argparse.Action`, dostarczając odpowiednie wywołanie sposobu postępowania ``__call__``. Sposób postępowania ``__call__`` powinien akceptować cztery parametry:

source: ``parser`` - The ArgumentParser object which contains this action.
pl: ``parser`` - przedmiot ArgumentParser który zawiera to działanie.

source: ``namespace`` - The namespace object that will be returned by :meth:`parse_args`. Most actions add an attribute to this object.
pl: ``namespace`` - przedmiot przestrzeni nazw który będzie zwrócony przez :meth:`parse_args`. Większość działań dodaje właściwość do przedmiotu.

source: ``values`` - The associated command-line args, with any type-conversions applied. (Type-conversions are specified with the type_ keyword argument to :meth:`add_argument`.
pl: ``values`` - Skojarzone parametry wiersza-poleceń, z wszystkimi zamianami-typów zastosowanymi. (Zamiana-typu są określone za pomocą parametru słowa kluczowego type_ dla sposobu postępowania :meth:`add_argument`.

source: ``option_string`` - The option string that was used to invoke this action. The ``option_string`` argument is optional, and will be absent if the action is associated with a positional argument.
pl: ``option_string`` - ciąg znaków opcji który był użyty do wywołania działania. Parametr ``option_string`` jest opcjonalny, i będzie nieobecny jeśli działanie jest związane z pozycyjnym parametrem.

source: An example of a custom action::
pl: Przykład szczególnego działania::

source: ArgumentParser objects usually associate a single command-line argument with a single action to be taken. The ``nargs`` keyword argument associates a different number of command-line arguments with a single action.. The supported values are:
pl: Przedmioty ArgumentParser zwykle wiąże pojedynczy parametr wiersza-poleceń z pojedynczym działaniem do wykonania. Parametr słowa kluczowego ``nargs`` kojarzy inną ilość parametrów wiersza-poleceń z pojedynczą akcją.. Dostępne wartości to:

source: N (an integer). N args from the command-line will be gathered together into a list. For example::
pl: N (liczba całkowita). N parametrów z linii poleceń będzie zebrane razem w listę. Dla przykładu::

source: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--foo', nargs=2) >>> parser.add_argument('bar', nargs=1) >>> parser.parse_args('c --foo a b'.split()) Namespace(bar=['c'], foo=['a', 'b']) Note that ``nargs=1`` produces a list of one item. This is different from the default, in which the item is produced by itself.
pl: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--foo', nargs=2) >>> parser.add_argument('bar', nargs=1) >>> parser.parse_args('c --foo a b'.split()) Namespace(bar=['c'], foo=['a', 'b']) Zauważ, że ``nargs=1`` tworzy listę jedno-elementową. To jest różne od domyślnego, gdzie element jest tworzony przez samego siebie.

source: ``'?'``. One arg will be consumed from the command-line if possible, and produced as a single item. If no command-line arg is present, the value from default_ will be produced. Note that for optional arguments, there is an additional case - the option string is present but not followed by a command-line arg. In this case the value from const_ will be produced. Some examples to illustrate this::
pl: ``'?'``. Jeden parametr będzie skonsumowany z wiersza-poleceń jeśli możliwe, i wyprodukowany jako pojedynczy element. Jeśli żaden parametr wiersza-poleceń nie jest obecny, wartość z domyślnej (z ang. - default_) zostanie wyprodukowany. Zauważ że dla opcjonalnych parametrów, istnieje dodatkowy przypadek - ciąg znaków opcji jest obecny ale nie następuje po nich parametr wiersza-poleceń. W tym przypadku wartość z const_ będzie produkowana. Niektóre przykłady aby to zilustrować::

source: One of the more common uses of ``nargs='?'`` is to allow optional input and output files::
pl: Jedno z częściej spotykanych użyć ``nargs='?'`` jest aby umożliwić opcjonalne pliki wejściowe i wyjściowe::

source: ``'*'``. All command-line args present are gathered into a list. Note that it generally doesn't make much sense to have more than one positional argument with ``nargs='*'``, but multiple optional arguments with ``nargs='*'`` is possible. For example::
pl: ``'*'``. Wszystkie parametry wiersza-poleceń obecne są zbierane w listę. Zauważ że zwykle nie ma za dużo sensu mieć więcej niż jeden pozycyjny parametr ``nargs='*'``, ale wiele opcjonalnych parametrów z ``nargs='*'`` jest możliwe. Dla przykładu::

source: ``'+'``. Just like ``'*'``, all command-line args present are gathered into a list. Additionally, an error message will be generated if there wasn't at least one command-line arg present. For example::
pl: ``'+'``. Tak jak ``'*'``, wszystkie parametry wiersza-poleceń obecne zbierane są w listę. Dodatkowo, wiadomość o błędzie będzie wytworzona jeśli nie było przynajmniej jednego parametru wiersza polecenia obecnego. Dla przykładu::

source: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('foo', nargs='+') >>> parser.parse_args('a b'.split()) Namespace(foo=['a', 'b']) >>> parser.parse_args(''.split()) usage: PROG [-h] foo [foo ...] PROG: error: too few arguments
pl: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('foo', nargs='+') >>> parser.parse_args('a b'.split()) Namespace(foo=['a', 'b']) >>> parser.parse_args(''.split()) użycie: PROG [-h] foo [foo ...] PROG: error: za mało parametrów

source: If the ``nargs`` keyword argument is not provided, the number of args consumed is determined by the action_. Generally this means a single command-line arg will be consumed and a single item (not a list) will be produced.
pl: Jeśli parametr słowa kluczowego ``nargs`` nie jest dostarczony, liczba parametrów konsumowanych jest określona przez action_. Zwykle to oznacza że pojedynczy parametr wiersza poleceń będzie skonsumowany i pojedynczy element (nie lista) będzie wyprodukowany.

source: The ``const`` argument of :meth:`add_argument` is used to hold constant values that are not read from the command line but are required for the various ArgumentParser actions. The two most common uses of it are:
pl: Parametr ``const`` dla sposobu postępowania :meth:`add_argument` jest używany aby przechowywać stałe wartości które nie są wczytywane z wiersza poleceń ale są wymagane dla różnych działań ( - z ang - actions) ArgumentParser'a. Dwa najczęstsze użycia tego są to:

source: When :meth:`add_argument` is called with ``action='store_const'`` or ``action='append_const'``. These actions add the ``const`` value to one of the attributes of the object returned by :meth:`parse_args`. See the action_ description for examples.
pl: Gdy sposób postępowania :meth:`add_argument` jest wywoływany z ``action=''store_const'`` lub ``action='append_const'``. Te działania dodają stałe (z ang. - ``const``) wartości do jednej z właściwości przedmiotu zwróconej przez :meth:`parse_args`. Zobacz opis action_ dla przykładów.

source: When :meth:`add_argument` is called with option strings (like ``-f`` or ``--foo``) and ``nargs='?'``. This creates an optional argument that can be followed by zero or one command-line args. When parsing the command-line, if the option string is encountered with no command-line arg following it, the value of ``const`` will be assumed instead. See the nargs_ description for examples.
pl: Gdy sposób postępowania :meth:`add_argument` jest wywoływany z ciągami opcji (takimi jak ``-f`` lub ``--foo``) i ``nargs='?'``. To tworzy dodatkowy nadobowiązkowy parametr, po którym można podać zero lub jeden parametr wiersza-poleceń. Gdy wczytywany jest wiersz poleceń, jeśli ciąg znaków opcji jest napotkany bez parametru wiersza polecenia następującego po nim, wartość ``const`` będzie przyjęta zamiast tej. Zobacz opis nargs_ dla przykładów.

source: The ``const`` keyword argument defaults to ``None``.
pl: Parametr słowa kluczowego ``const`` domyślnie równy jest ``None``.

source: default
pl: domyślnie ( - z ang. - default)

source: All optional arguments and some positional arguments may be omitted at the command-line. The ``default`` keyword argument of :meth:`add_argument`, whose value defaults to ``None``, specifies what value should be used if the command-line arg is not present. For optional arguments, the ``default`` value is used when the option string was not present at the command line::
pl: Wszystkie opcjonalne parametry i niektóre parametry pozycyjne mogą być pominięte w wierszu-poleceń. Domyślny - z ang. - ``default`` parametr słowa kluczowego dla sposobu postępowania :meth:`add_argument` którego wartość domyślnie równa jest ``None``, określa która wartość powinna być użyta jeśli parametr wiersza poleceń nie jest obecny. Dla opcjonalnych parametrów wartość ``domyślna`` - z ang. - ``default`` jest używana gdy ciąg znaków opcji nie był obecny w wierszu polecenia::

source: For positional arguments with nargs_ ``='?'`` or ``'*'``, the ``default`` value is used when no command-line arg was present::
pl: Dla pozycyjnych parametrów z nargs_ ``='?'`` lub ``'*'``, domyślna ( - z ang. - ``default`` ) wartość jest używana gdy żadne parametry wiersza-poleceń nie są obecne::

source: Providing ``default=argparse.SUPPRESS`` causes no attribute to be added if the command-line argument was not present.::
pl: Dostarczenie ``default=argparse.SUPPRESS`` powoduje że żadna właściwość nie będzie dodana jeśli parametr wiersza polecenia nie był obecny.::

source: type
pl: typ

source: By default, ArgumentParser objects read command-line args in as simple strings. However, quite often the command-line string should instead be interpreted as another type, like a :class:`float`, :class:`int` or :class:`file`. The ``type`` keyword argument of :meth:`add_argument` allows any necessary type-checking and type-conversions to be performed. Many common built-in types can be used directly as the value of the ``type`` argument::
pl: Domyślnie przedmioty ArgumentParser wczytują parametry wiersza-poleceń jako proste ciągi znaków. Jednakże, całkiem często ciąg znaków wiersza-poleceń powinien być interpretowany jako następny typ, jako :class:`float`, :class:`int` lub :class:`file`. parametr słowa kluczowego ``type`` sposobu postępowania :meth:`add_argument` pozwala dowolnym koniecznym sprawdzeniom typu i konwersjom typu aby były przeprowadzone. Wiele wspólnych wbudowanych typów może być użyte bezpośrednio jako wartości parametru ``type``::
